/*
 * 立创开发板软硬件资料与相关扩展板软硬件资料官网全部开源
 * 开发板官网：www.lckfb.com
 * 文档网站：wiki.lckfb.com
 * 技术支持常驻论坛，任何技术问题欢迎随时交流学习
 * 嘉立创社区问答：https://www.jlc-bbs.com/lckfb
 * 关注bilibili账号：【立创开发板】，掌握我们的最新动态！
 * 不靠卖板赚钱，以培养中国工程师为己任
 */

#include "bsp_max7219.h"
#include "stdio.h"



/******************************************************************
 * 函 数 名 称：Write_Max7219_byte
 * 函 数 说 明：向MAX7219写入字节
 * 函 数 形 参：dat写入的数据
 * 函 数 返 回：无
 * 作       者：LCKFB
 * 备       注：无
******************************************************************/
void Write_Max7219_byte(uint8_t dat)
{
    uint8_t i;
    for(i=8;i>=1;i--)
    {
        MAX7219_CLK(0);
        delay_us(3);
        if( dat&0x80 )
        {
            MAX7219_DIN(1);
            delay_us(3);
        }
        else
        {
            MAX7219_DIN(0);
            delay_us(3);
        }
        dat=dat<<1;
        MAX7219_CLK(1);
        delay_us(3);
    }
}

/******************************************************************
 * 函 数 名 称：Write_Max7219
 * 函 数 说 明：向MAX7219写入数据
 * 函 数 形 参：address写入地址  dat写入数据
 * 函 数 返 回：无
 * 作       者：LCKFB
 * 备       注：无
******************************************************************/
void Write_Max7219(uint8_t address,uint8_t dat)
{
        MAX7219_CS(0);
        Write_Max7219_byte(address);           //写入地址，即数码管编号1-8
        Write_Max7219_byte(dat);               //写入数据，即数码管显示内容字
        MAX7219_CS(1);
}

/******************************************************************
 * 函 数 名 称：Write_Max7219_2
 * 函 数 说 明：向第二片MAX7219写入数据
 * 函 数 形 参：address写入地址  dat写入数据
 * 函 数 返 回：无
 * 作       者：LCKFB
 * 备       注：只有接入第二片MAX7219才可以用
******************************************************************/
void Write_Max7219_2(uint8_t address,uint8_t dat)
{
        MAX7219_CS(0);
        Write_Max7219_byte(address);   //写入地址，即数码管编号1-8
        Write_Max7219_byte(dat);       //写入数据，即数码管显示内容
        MAX7219_CLK(1);
        Write_Max7219_byte(0X00);      //对第一片执行空操作
        Write_Max7219_byte(0X00);
        MAX7219_CS(1);
}

/******************************************************************
 * 函 数 名 称：Write_Max7219_AllOff
 * 函 数 说 明：控制第一片MAX7219的全部数码管全灭
 * 函 数 形 参：address写入地址  dat写入数据
 * 函 数 返 回：无
 * 作       者：LCKFB
 * 备       注：
******************************************************************/
void Write_Max7219_AllOff(void)
{
    int i =  0;
    for( i = 1; i < 9; i++ )
    {
        MAX7219_CS(0);
        Write_Max7219_byte(i);   //写入地址，即数码管编号1-8
        Write_Max7219_byte(15);  //全灭
        MAX7219_CS(1);
    }

}
/******************************************************************
 * 函 数 名 称：MAX7219_Init
 * 函 数 说 明：MAX7219初始化
 * 函 数 形 参：无
 * 函 数 返 回：无
 * 作       者：LCKFB
 * 备       注：无
******************************************************************/
void MAX7219_Init(void)
{
    Write_Max7219(0x09, 0xff);       //译码方式：BCD码
    Write_Max7219(0x0a, 0x03);       //亮度
    Write_Max7219(0x0b, 0x07);       //扫描界限；4个数码管显示
    Write_Max7219(0x0c, 0x01);       //掉电模式：0，普通模式：1
    Write_Max7219(0x0f, 0x01);       //显示测试：1；测试结束，正常显示：0
}